app/views/users/_attended.html.erb

  <tbody>
  <% @user.events.previous.each do |event| %>
---
SELECT "events".* FROM "events" INNER JOIN "attendances" ON "events"."id" = "attendances"."event_id" WHERE "attendances"."user_id" = ? AND (date < '2020-10-28')  [["user_id", 3]]