app/views/users/_attend_events.html.erb

SELECT "events".* FROM "events" INNER JOIN "attendances" ON "events"."id" = "attendances"."event_id" WHERE "attendances"."user_id" = ? AND (date > '2020-10-28')  [["user_id", 3]]
---
  <tbody>
  <% @user.events.upcoming.each do |event| %>