app/views/events/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <li>
       <p>User Name: <%= @users.find(i.user_id).username %> <br/></p>
      	<p>Email: <%= @users.find(i.user_id).email %></p>