app/helpers/users_helper.rb

SELECT 1 AS one FROM "events" INNER JOIN "attendances" ON "events"."id" = "attendances"."event_id" WHERE "attendances"."user_id" = ? AND (date < '2020-10-28') LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
---
  def empty_attending_table
    if @user.events.empty?

SELECT 1 AS one FROM "events" INNER JOIN "attendances" ON "events"."id" = "attendances"."event_id" WHERE "attendances"."user_id" = ? AND (date == '2020-10-28') LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
---
  def empty_attended
    if @user.events.previous.empty?

SELECT 1 AS one FROM "events" INNER JOIN "attendances" ON "events"."id" = "attendances"."event_id" WHERE "attendances"."user_id" = ? AND (date == '2020-10-29') LIMIT ?  [["user_id", 9], ["LIMIT", 1]]
---
  def empty_today
    if @user.events.today.empty?