app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE (date > '2020-10-28')
SELECT "users".* FROM "users"
---
  def index
    @events = Event.all
    @users = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "attendances".* FROM "attendances" WHERE "attendances"."event_id" = ? AND "attendances"."event_id" = ?  [["event_id", 1], ["event_id", 1]]
---
  def show
    set_event
    @users = User.all
    @user = User.find(@event.creator.id)
    @attendees = Attendance.where(event_id: @event.id)

INSERT INTO "events" ("title", "body", "date", "created_at", "updated_at", "creator_id") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "attendances" ("user_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["event_id", 6], ["created_at", "2020-10-28 16:28:43.119822"], ["updated_at", "2020-10-28 16:28:43.119822"]]
---
  def attending
    set_event
    @attendee = Attendance.new
    @attendee.event_id = @event.id
    @attendee.user_id = current_user.id
    @attendee.save

INSERT INTO "events" ("title", "body", "date", "created_at", "updated_at", "creator_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save