app/controllers/logins_controller.rb

SELECT "users".* FROM "users" WHERE (Balerum03) LIMIT ?  [["LIMIT", 1]]
---
  def create
    @user = User.find_by(params[:username])