app/controllers/sessions_controller.rb

  def create
   @user = User.where(username: params[:username])
   if @user.empty? == false
---
SELECT "users".* FROM "users" WHERE "users"."username" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."username" = ?  [["username", "Balerum03"]]
SELECT 1 AS one FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Balerum03"], ["LIMIT", 1]]