app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT "users".* FROM "users" WHERE (1) LIMIT ?  [["LIMIT", 1]]

  def create
    @user = User.new(user_params)
    session[:user_id] = @user.id
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "hellothere"], ["email", "test@test4.com"], ["created_at", "2020-10-29 16:11:57.822920"], ["updated_at", "2020-10-29 16:11:57.822920"]]